src/Catalogs/SSL_IT_УниверсальныеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>SSL_IT_УниверсальныеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SSL_IT_СпособыЗаданияУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыражениеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаУсловия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомбинацииУсловий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяВложенность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВложенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/SSL_IT_СпособыЗаданияУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_СпособыЗаданияУсловия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРежимеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВстроенномЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомбинацияИзДругихУсловий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_ВариантыВыполненияЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВариантыВыполненияЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьПакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьПакетСПромежуточнымиДанными</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_РезультатыВыполненияЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_РезультатыВыполненияЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SSL_IT_УниверсальныеУсловия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая()
		И (Не(Параметры.Свойство("ЗначениеКопирования"))
			Или Не(ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Наименование))) Тогда
			
		НастройкиУсловия = Неопределено;
		НастройкиКомбинацииУсловий = Неопределено;
		Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.ВРежимеКонструктора;
	ИначеЕсли Объект.Ссылка.Пустая()
		И Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования.Наименование) Тогда
		
		НастройкиУсловия = Параметры.ЗначениеКопирования.НастройкаУсловия.Получить();
		НастройкиКомбинацииУсловий = Параметры.ЗначениеКопирования.НастройкаКомбинацииУсловий.Получить();
	Иначе
		НастройкиУсловия = Объект.Ссылка.НастройкаУсловия.Получить();
		НастройкиКомбинацииУсловий = Объект.Ссылка.НастройкаКомбинацииУсловий.Получить();
	КонецЕсли;
	
	ЗаполнитьОписаниеРеквизитовПредмета();
	НастроитьКомпоновщикУсловия(НастройкиУсловия);
	НастроитьКомпоновщикКомбинацииУсловий(НастройкиКомбинацииУсловий);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + СтрЗаменить(Строка(Объект.СпособЗаданияУсловия), " ", "")];	
	
	// Настройка элементов конструктора условий
	Элементы.КомпоновщикНастройкиОтборЛевоеЗначение.КнопкаОчистки = Ложь;
	
	// Настройка элементов комбинатора условий
	Элементы.КомпоновщикУсловийНастройкиОтборЛевоеЗначение.КнопкаОчистки = Ложь;
	Элементы.КомпоновщикУсловийНастройкиОтборЛевоеЗначение.ТолькоПросмотр = Истина;
	Элементы.КомпоновщикУсловийНастройкиОтборВидСравнения.Видимость = Ложь;
	Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение.КнопкаВыпадающегоСписка = Истина;
	Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение.УстановитьДействие("НачалоВыбора", "КомпоновщикУсловийНастройкиОтборПравоеЗначениеНачалоВыбора");
	Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение.УстановитьДействие("АвтоПодбор", "КомпоновщикУсловийНастройкиОтборПравоеЗначениеАвтоПодбор");
	Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение.УстановитьДействие("ОкончаниеВводаТекста", "КомпоновщикУсловийНастройкиОтборПравоеЗначениеОкончаниеВводаТекста");
	                                                    
	// Заполнение поддерживаемых видов метаданных
	ПоддерживаемыеМетаданныеXML = Константы.SSL_IT_УниверсальныеУсловия_ПоддерживаемыеМетаданные.Получить();
	
	Если Не(ПустаяСтрока(ПоддерживаемыеМетаданныеXML)) Тогда 
		ПоддерживаемыеМетаданные.ЗагрузитьЗначения(SSL_IT_ОбработкаДанных.СтрокаXDTOВЗначение(ПоддерживаемыеМетаданныеXML));
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыражениеУсловия.УстановитьТекст(Объект.ВыражениеУсловия);
	Элементы.СкрытьПоказатьДеревоРеквизитов.Пометка = Элементы.ОписаниеРеквизитовПредмета.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаданияУсловияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СпособЗаданияУсловия) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + СтрЗаменить(Строка(Объект.СпособЗаданияУсловия), " ", "")];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	
	ОбъектМетаданныхПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных();
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", Настройки);
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ЭлементОтбора.ПравоеЗначение	= ПоддерживаемыеМетаданные;
	
	ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.Форма.SSL_IT_ФормаВыбораМетаданных", 
		ПараметрыФормы, 
		Элементы.ОбъектМетаданных); 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = ПолучитьДанныеВыбораОбъектаМетаданных(
		ПараметрыПолученияДанных.СтрокаПоиска,
		ПоддерживаемыеМетаданные,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ДанныеВыбора = ПолучитьДанныеВыбораОбъектаМетаданных(
		ПараметрыПолученияДанных.СтрокаПоиска,
		ПоддерживаемыеМетаданные,
		СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеУсловияПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеРеквизитовПредметаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Объект.ВыражениеУсловия = Объект.ВыражениеУсловия + Элемент.ТекущиеДанные.Путь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикУсловийНастройкиОтборПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные.ЛевоеЗначение <> Неопределено Тогда
		ДобавленноеУсловие = Элемент.ТекущиеДанные.ПравоеЗначение;
		Результат = ПроверитьНаличиеУсловияВДереве(Ложь);
		
		Если Результат Тогда
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Нельзя добавить условие ""%1"". Произошло зацикливание условий.'"),
				ДобавленноеУсловие);
			Предупреждение(ТекстПредупреждения);
			УдалитьУсловиеИзКомбинацииУсловий(ДобавленноеУсловие);
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикУсловийНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Элементы.КомпоновщикУсловийНастройкиОтбор.ТекущиеДанные <> Неопределено
		И ТипЗнч(Элементы.КомпоновщикУсловийНастройкиОтбор.ТекущиеДанные.ТипГруппы) = Тип("ТипГруппыЭлементовОтбораКомпоновкиДанных") Тогда  
		РодительОтбора = КомпоновщикУсловий.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(
			Элементы.КомпоновщикУсловийНастройкиОтбор.ТекущаяСтрока);
	Иначе
		РодительОтбора = КомпоновщикУсловий.Настройки.Отбор;	
	КонецЕсли;	
	
	ЭлементОтбора = РодительОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ПолеОтбора = Новый ПолеКомпоновкиДанных("РезультатВыполненияУсловия");
    ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	Элементы.КомпоновщикУсловийНастройкиОтбор.Развернуть(
			КомпоновщикУсловий.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(РодительОтбора));
		
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикУсловийНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных();
	ПараметрыФормы = Новый Структура("ФиксированныеНастройки", Настройки);
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка.ОбъектМетаданных");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= ПолучитьЗначенияОтбораПоМетаданным();
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение	= Объект.Ссылка;
	 
	ОткрытьФорму("Справочник.SSL_IT_УниверсальныеУсловия.ФормаВыбора", ПараметрыФормы, Элементы.КомпоновщикУсловийНастройкиОтборПравоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикУсловийНастройкиОтборПравоеЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	ДанныеВыбора = ОпределитьДанныеВыбораУсловия(ПараметрыПолученияДанных.СтрокаПоиска, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикУсловийНастройкиОтборПравоеЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ДанныеВыбора = ОпределитьДанныеВыбораУсловия(ПараметрыПолученияДанных.СтрокаПоиска, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ВыражениеУсловия = ВыражениеУсловия.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не(УсловиеПоКлючуУникально()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Данный ключ уже указан для другого условия'"),, "Объект.Ключ",, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий
		И КомпоновщикУсловий.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указано ни одного условия'"),,"КомпоновщикУсловий.Настройки.Отбор",, Отказ);
		
	ИначеЕсли Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.ВРежимеКонструктора
		И Компоновщик.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указано ни одного правила'"),,"Компоновщик.Настройки.Отбор",, Отказ);
		
	ИначеЕсли Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.НаВстроенномЯзыке
		И НЕ ЗначениеЗаполнено(Объект.ВыражениеУсловия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не задано выражение'"),,"Объект.ВыражениеУсловия",, Отказ);
	КонецЕсли;
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий
		И ПроверитьНаличиеУсловияВДереве(Истина) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Заполнены не все значения в комбинации условий'"),,"КомпоновщикУсловий.Настройки.Отбор",, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.ВРежимеКонструктора
		И ПроверитьНаличиеПустыхСтрокОтбораВДереве() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Среди правил есть некорректно заполненные'"),,"Компоновщик.Настройки.Отбор",, Отказ);
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.НастройкаУсловия = Новый ХранилищеЗначения(Компоновщик.ПолучитьНастройки());
	ТекущийОбъект.НастройкаКомбинацииУсловий = Новый ХранилищеЗначения(КомпоновщикУсловий.ПолучитьНастройки());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ВставитьРеквизитИзДерева(Команда)
	
	Если Элементы.ОписаниеРеквизитовПредмета.ТекущиеДанные <> Неопределено Тогда
		Элементы.ВыражениеУсловия.ВыделенныйТекст = Элементы.ОписаниеРеквизитовПредмета.ТекущиеДанные.ПолныйПуть;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКлюч(Команда)
	
	Объект.Ключ = СтрШаблон("%1_%2",
		ПолучитьКлючРодителя(), 
		SSL_IT_СтроковыеФункцииКлиентСервер.ПолучитьКлючПоСтроке(Объект.Наименование));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУсловиеПоПредмету(Команда)
	
	Если Модифицированность Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВыполнитьУсловиеПоПредметуЗавершение", ЭтотОбъект),
			"Перед проверкой условие будет записано. Продолжить?",
			РежимДиалогаВопрос.ОКОтмена,
			30,
			КодВозвратаДиалога.ОК,
			"Запись универсального условия",
			КодВозвратаДиалога.ОК);
	Иначе
		ВыполнитьУсловиеПоПредметуСервер();	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьДеревоРеквизитов(Команда)
	
	Элементы.СкрытьПоказатьДеревоРеквизитов.Пометка = Не(Элементы.СкрытьПоказатьДеревоРеквизитов.Пометка);
	Элементы.ОписаниеРеквизитовПредмета.Видимость = Элементы.СкрытьПоказатьДеревоРеквизитов.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьШаблонВыражения(Команда)
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ЗавершитьВставкуШаблонаВыражения", ЭтаФорма),
		"Очистить поле выражения?", 
		РежимДиалогаВопрос.ДаНетОтмена,
		30,
		КодВозвратаДиалога.Да,
		"Вставка шаблона выражения",
		КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	SSL_IT_СтроковыеФункцииКлиентСервер.ДобавитьУдалитьКомментарий(
		Элементы.ВыражениеУсловия, 
		ВыражениеУсловия, 
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКомментарий(Команда)
	
	SSL_IT_СтроковыеФункцииКлиентСервер.ДобавитьУдалитьКомментарий(
		Элементы.ВыражениеУсловия, 
		ВыражениеУсловия, 
		Ложь);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// КЛИЕНТ
&НаКлиенте
Процедура ЗавершитьВставкуШаблонаВыражения(РезультатВопроса, ДополнительныеПараметры) Экспорт 

	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ВыражениеУсловия.Очистить();
	КонецЕсли;
	
	ВыражениеУсловия.ДобавитьСтроку( 
		"// SSL_IT ШАБЛОН ВЫРАЖЕНИЯ УСЛОВИЯ
		|// Результатом работы выражения должно быть значение ИСТИНА или ЛОЖЬ, 
		|// записанное в переменную ""Результат"".
		|//
		|// Пример:
		|Если Истина Тогда
		|	Результат = Истина;
		|КонецЕсли;
		|");
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьУсловиеПоПредметуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда 
		Записать();
		ВыполнитьУсловиеПоПредметуСервер();
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция ОпределитьДанныеВыбораУсловия(СтрокаПоиска, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Возврат ПолучитьДанныеВыбораУсловия(СтрокаПоиска, ПолучитьЗначенияОтбораПоМетаданным(), Объект.Ссылка);
	
КонецФункции	

&НаКлиенте
Функция ПолучитьЗначенияОтбораПоМетаданным()
	
	ЗначенияОтбора = Новый Массив();
	ЗначенияОтбора.Добавить(Объект.ОбъектМетаданных);
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда 
		ЗначенияОтбора.Добавить(ПустойОбъектМетаданных);
	КонецЕсли;
	
	// Возврат 
	Возврат ЗначенияОтбора;
	
КонецФункции

// СЕРВЕР
&НаСервере
Процедура ОбъектМетаданныхПриИзмененииНаСервере()
	
	//Модифицированность = Истина;
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда 
		Если Не(ЗначениеЗаполнено(Объект.ОбъектМетаданных.Родитель)) Тогда 
			Объект.ОбъектМетаданных = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Нельзя выбирать корневые элементы метаданных",,
				"ОбъектМетаданных",
				"Объект");
			Возврат;	
		КонецЕсли;	
	КонецЕсли;	
	
	ЗаполнитьОписаниеРеквизитовПредмета();
	НастроитьКомпоновщикУсловия();	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеУсловияВДереве(ИщемПустоеЗначение)	
	
	Результат = Ложь;
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий Тогда
		ЭлементыНастройкиОтбора = КомпоновщикУсловий.Настройки.Отбор.Элементы;
		ИскомоеУсловие = ?(ИщемПустоеЗначение, Неопределено, Объект.Ссылка);
		Результат = ВыполнитьПоискУсловияВОдномУровнеКомбинацииУсловий(ЭлементыНастройкиОтбора, ИскомоеУсловие);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УдалитьУсловиеИзКомбинацииУсловий(ИмяУсловия)
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий Тогда
		ЭлементыНастройкиОтбора = КомпоновщикУсловий.Настройки.Отбор.Элементы;
		ВыполнитьПоискИУдалениеДляОдногоУровня(ЭлементыНастройкиОтбора, ИмяУсловия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискИУдалениеДляОдногоУровня(Элементы, ИмяУсловия) 	
	
	Для Каждого ЭлементОтбора Из Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
			ВыполнитьПоискИУдалениеДляОдногоУровня(ЭлементОтбора.Элементы, ИмяУсловия);
		ИначеЕсли ЭлементОтбора.ПравоеЗначение <> Неопределено Тогда
			СпособЗаданияУсловия = ЭлементОтбора.ПравоеЗначение.СпособЗаданияУсловия;
				
			Если ЭлементОтбора.ПравоеЗначение.Наименование = ИмяУсловия Тогда
				ЭлементОтбора.ПравоеЗначение = Справочники.SSL_IT_УниверсальныеУсловия.ПустаяСсылка();
			ИначеЕсли СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий Тогда
            	ВыполнитьПоискИУдалениеДляОдногоУровня(ЭлементОтбора.ПравоеЗначение.НастройкаКомбинацииУсловий.Получить().Отбор.Элементы, ИмяУсловия);
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПоискУсловияВОдномУровнеКомбинацииУсловий(Элементы, ИскомоеУсловие)  	
	
	Для Каждого ЭлементОтбора Из Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
			Если ВыполнитьПоискУсловияВОдномУровнеКомбинацииУсловий(ЭлементОтбора.Элементы, ИскомоеУсловие) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе			
			Если (ЗначениеЗаполнено(ИскомоеУсловие) 
				И ЭлементОтбора.ПравоеЗначение = ИскомоеУсловие)
				ИЛИ (НЕ ЗначениеЗаполнено(ИскомоеУсловие) 
				И НЕ ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)) Тогда
				
				Возврат Истина;
			ИначеЕсли  ЭлементОтбора.ПравоеЗначение <> Неопределено
				И ЭлементОтбора.ПравоеЗначение.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.КомбинацияИзДругихУсловий
				И ВыполнитьПоискУсловияВОдномУровнеКомбинацииУсловий(ЭлементОтбора.ПравоеЗначение.НастройкаКомбинацииУсловий.Получить().Отбор.Элементы, ИскомоеУсловие) Тогда
				
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;  
	
	Возврат Ложь;  
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОписаниеРеквизитовПредмета()	
	
	Дерево = РеквизитФормыВЗначение("ОписаниеРеквизитовПредмета");  	
	Дерево.Строки.Очистить(); 	
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда 
		ОписаниеПредмета = Дерево.Строки.Добавить();
		ОписаниеПредмета.Имя	= "ПредметУсловия";
		ОписаниеПредмета.Тип	= Объект.ОбъектМетаданных.ПолноеИмя;
		ОписаниеПредмета.Путь	= "ПредметУсловия";  	
	КонецЕсли;	
		
	Если Метаданные.НайтиПоПолномуИмени(Объект.ОбъектМетаданных.ПолноеИмя) <> Неопределено Тогда       
		ОбъектМетаданных = Метаданные[Объект.ОбъектМетаданных.Родитель.ПолноеИмя][Объект.ОбъектМетаданных.Имя];
		
		Для Каждого СтандартныйРеквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			ОписаниеРеквизита = ОписаниеПредмета.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ОписаниеРеквизита, СтандартныйРеквизит, "Имя,Тип"); 
			ОписаниеРеквизита.Путь = СтрШаблон("%1.%2", ОписаниеПредмета.Путь, СтандартныйРеквизит.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			ОписаниеРеквизита = ОписаниеПредмета.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ОписаниеРеквизита, Реквизит, "Имя,Тип"); 
			ОписаниеРеквизита.Путь = СтрШаблон("%1.%2", ОписаниеПредмета.Путь, Реквизит.Имя);	
		КонецЦикла;
		
		Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
			ОписаниеТабличнойЧасти = ОписаниеПредмета.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ОписаниеТабличнойЧасти, ТабличнаяЧасть, "Имя");
			ОписаниеТабличнойЧасти.Тип	= "Табличная часть";
			ОписаниеТабличнойЧасти.Путь	= СтрШаблон("%1.%2", ОписаниеПредмета.Путь, ТабличнаяЧасть.Имя);
			
			Для Каждого СтандартныйРеквизитТабличнойЧасти Из ТабличнаяЧасть.СтандартныеРеквизиты Цикл
				ОписаниеРеквизитаТабличнойЧасти = ОписаниеТабличнойЧасти.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(ОписаниеРеквизитаТабличнойЧасти, СтандартныйРеквизитТабличнойЧасти, "Имя,Тип"); 
				ОписаниеРеквизитаТабличнойЧасти.Путь = СтрШаблон("%1.%2", ОписаниеТабличнойЧасти.Путь, СтандартныйРеквизитТабличнойЧасти.Имя); 
			КонецЦикла;

			Для Каждого РеквизитТабличнойЧасти Из ТабличнаяЧасть.Реквизиты Цикл
				ОписаниеРеквизитаТабличнойЧасти = ОписаниеТабличнойЧасти.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(ОписаниеРеквизитаТабличнойЧасти, РеквизитТабличнойЧасти, "Имя,Тип"); 
				ОписаниеРеквизитаТабличнойЧасти.Путь = СтрШаблон("%1.%2", ОписаниеТабличнойЧасти.Путь, РеквизитТабличнойЧасти.Имя);	
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ОписаниеРеквизитовПредмета"); 	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКомпоновщикУсловия(Настройки = Неопределено)
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда 
		СхемаКомпоновкиДанных = SSL_IT_УниверсальныеУсловияСерверПривилегированный.ОпределитьСхемуКонструктораУсловий(Объект.ОбъектМетаданных.ПолноеИмя);
	Иначе
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных();	
	КонецЕсли;	
	
	SSL_IT_УниверсальныеУсловияСерверПривилегированный.ОпределитьКомпоновщикНастроек(СхемаКомпоновкиДанных, Компоновщик, Настройки);
	УстановитьПредметУсловия();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКомпоновщикКомбинацииУсловий(Настройки = Неопределено)
	
	СхемаКомпоновкиДанных = SSL_IT_УниверсальныеУсловияСерверПривилегированный.ОпределитьСхемуКомбинацииУсловий_Интерфейс();
	SSL_IT_УниверсальныеУсловияСерверПривилегированный.ОпределитьКомпоновщикНастроек(СхемаКомпоновкиДанных, КомпоновщикУсловий, Настройки);
	УстановитьПредметУсловия();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредметУсловия()
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда 
		ПредметУсловия = Объект.ОбъектМетаданных.ЗначениеПустойСсылки;
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Функция УсловиеПоКлючуУникально()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Условия.Ссылка          
		|ИЗ
		|	Справочник.SSL_IT_УниверсальныеУсловия КАК Условия
		|ГДЕ
		|	Условия.Ключ = &Ключ
		|	И Условия.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ключ", Объект.Ключ);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Возврат
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция ПроверитьНаличиеПустыхСтрокОтбораВДереве()
	
	Результат = Ложь;
	
	Если Объект.СпособЗаданияУсловия = Перечисления.SSL_IT_СпособыЗаданияУсловия.ВРежимеКонструктора Тогда
		ЭлементыНастройкиОтбора = Компоновщик.Настройки.Отбор.Элементы;
		Результат = ВыполнитьПоискПустойСтрокиВОдномУровнеНастройкиОтбора(ЭлементыНастройкиОтбора);
	КонецЕсли;
	
	Возврат Результат;		
	
КонецФункции

&НаСервере
Функция ВыполнитьПоискПустойСтрокиВОдномУровнеНастройкиОтбора(Элементы)
	
	Для Каждого ЭлементОтбора Из Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
			Если ВыполнитьПоискПустойСтрокиВОдномУровнеНастройкиОтбора(ЭлементОтбора.Элементы) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе			
			Если (НЕ ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)
					ИЛИ НЕ ЗначениеЗаполнено(Строка(ЭлементОтбора.ЛевоеЗначение)))
				И ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Заполнено
				И ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВыполнитьУсловиеПоПредметуСервер()
	
	Результат = SSL_IT_УниверсальныеУсловияСерверПривилегированный.ВыполнитьУсловиеПоПредмету(Объект.Ссылка, ПредметУсловия, Неопределено,, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючРодителя()
	
	Возврат Объект.Родитель.Ключ; 
	
КонецФункции

// СЕРВЕР БЕЗ КОНТЕКСТА
// Не вынесена в модуль менеджера, что бы не ломать типовой объект.
&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораОбъектаМетаданных(СтрокаПоиска, ПоддерживаемыеМетаданные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыЗапроса = Новый Структура();
	ДанныеВыбора = Новый СписокЗначений();
	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК ОбъектМетаданных,
		|	ИдентификаторыОбъектовМетаданных.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Ссылка В ИЕРАРХИИ(&ПоддерживаемыеМетаданные)
		|	И ИдентификаторыОбъектовМетаданных.Родитель <> ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка)
		|	И НЕ ИдентификаторыОбъектовМетаданных.ПометкаУдаления");

	Если Не(ПустаяСтрока(СтрокаПоиска)) Тогда 
		SSL_IT_СхемыЗапросов.ДобавитьУсловие("ИдентификаторыОбъектовМетаданных.Наименование ПОДОБНО &СтрокаПоиска",,, СхемаЗапроса);
		ПараметрыЗапроса.Вставить("СтрокаПоиска", СтрШаблон("%%%1%%", СтрокаПоиска)); 
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("ПоддерживаемыеМетаданные", ПоддерживаемыеМетаданные);
	
	ТаблицаМетаданных = SSL_IT_Запросы.СформироватьВыполнитьЗапрос(
		СхемаЗапроса.ПолучитьТекстЗапроса(),,
		ПараметрыЗапроса,
		Перечисления.SSL_IT_ВариантыВыполненияЗапроса.Выполнить,
		Перечисления.SSL_IT_РезультатыВыполненияЗапроса.Выгрузка);
		
	ДанныеВыбора.ЗагрузитьЗначения(ТаблицаМетаданных.ВыгрузитьКолонку("ОбъектМетаданных"));	
	
	// Возврат
	Возврат ДанныеВыбора;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораУсловия(СтрокаПоиска, ОбъектыМетаданных, ТекущееУсловие)
	
	ПараметрыЗапроса = Новый Структура();
	ДанныеВыбора = Новый СписокЗначений();
	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		|	SSL_IT_УниверсальныеУсловия.Ссылка КАК УниверсальноеУсловие,
		|	SSL_IT_УниверсальныеУсловия.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.SSL_IT_УниверсальныеУсловия КАК SSL_IT_УниверсальныеУсловия
		|ГДЕ
		|	SSL_IT_УниверсальныеУсловия.ОбъектМетаданных В(&ОбъектыМетаданных)
		|	И SSL_IT_УниверсальныеУсловия.Ссылка <> &ТекущееУсловие
		|	И НЕ SSL_IT_УниверсальныеУсловия.ЭтоГруппа");
	
	Если Не(ПустаяСтрока(СтрокаПоиска)) Тогда 
		SSL_IT_СхемыЗапросов.ДобавитьУсловие("SSL_IT_УниверсальныеУсловия.Наименование ПОДОБНО &СтрокаПоиска",,, СхемаЗапроса);
		ПараметрыЗапроса.Вставить("СтрокаПоиска", СтрШаблон("%%%1%%", СтрокаПоиска)); 
	КонецЕсли;	
	
	ПараметрыЗапроса.Вставить("ОбъектыМетаданных", ОбъектыМетаданных);
	ПараметрыЗапроса.Вставить("ТекущееУсловие", ТекущееУсловие);
	
	ВыборкаУсловий = SSL_IT_Запросы.СформироватьВыполнитьЗапрос(
		СхемаЗапроса.ПолучитьТекстЗапроса(),,
		ПараметрыЗапроса,
		Перечисления.SSL_IT_ВариантыВыполненияЗапроса.Выполнить,
		Перечисления.SSL_IT_РезультатыВыполненияЗапроса.Выборка);
	
	Пока ВыборкаУсловий.Следующий() Цикл 
		ЭлементДанныхВыбора = Новый Структура();
		ЭлементДанныхВыбора.Вставить("Значение",		ВыборкаУсловий.УниверсальноеУсловие);
		ЭлементДанныхВыбора.Вставить("ПометкаУдаления",	ВыборкаУсловий.ПометкаУдаления);
		ЭлементДанныхВыбора.Вставить("Предупреждение",	""); // Тут может быть ваша реклама.
		ДанныеВыбора.Добавить(ЭлементДанныхВыбора);
	КонецЦикла;
	
	// Возврат
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти
